---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.CapitalizationForLoadNames.SourceParameters
enum: Autodesk.Revit.DB.Electrical.CapitalizationForLoadNames
source: html/526f8002-d587-dfa4-709e-514341a1edbd.htm
---
# Autodesk.Revit.DB.Electrical.CapitalizationForLoadNames.SourceParameters

Use the capitalization formatting taken from the parameters that create the load name (Revit 2011 and previous).